{
  "commends": [
    "If anyone else is having a terrible time with the new Lannett generic Adderall, you can report this to the FDA. I have been having crippling headaches, stomach aches, and the medication doesn’t even feel like it works!!! I get tired after I take it and then can’t sleep all night because of it. HORRIBLE. Google FDA MedWatch online reporting to fill in the form.",
    "Many Adderall/Amp-Dex tablets before 2020 worked great, especially Teva & Sandoz & occasionally Core. I can honestly say from 2020 to now that they've either taken out half the amount of drug per total mg and replaced it with cheap fillers, or taken the entire drug out and filled it with sugar. Look at the most helpful replies on here, all but one are from 2019 and before. If we’re all experiencing the same problems, the issue is the manufacturers, not any of us. This needs to be fixed.",
    "Since the shortage, Teva is definitely leaving something out or substituting ingredients. That is the problem. I have been struggling for months because these new pills are a joke. I just ran across a few that I had left from before the shortage, took one, and bam... worked like a charm. That's definitely proof that this is NOT a tolerance issue. TEVA shame on you. This is not a joke for those of us who have to take this medication to function in our daily lives.",
    "Generic Adderall: TEVA vs. ALVOGEN. All generic Adderall is NOT the same, trust me! I don't care what your physician or pharmacist may say. I've taken Adderall for nearly 25 plus years for ADD. Why? It works twice as good. Ask anyone who's taken different brands before. For the best quality and most potent Adderall on the market, it is made by a company called TEVA. Even pharmacists tell me that when they run out of TEVA and must use ALVOGEN, their patients complain because pharmacies cannot keep TEVA in stock. Consumers know it's the best and most effective for ADD and ADHD.",
    "Been taking Adderall and generics for 25 years. I just spent a year on the ALV manufacturer of amphetamine with dextroamphetamine and everything took a nosedive. GPA went down, personal life, and just general capacity for life. Ended up with some acute OCD due to some other factors. Switched back to TEVA and I'm instantly clearer. Whatever FDA regulations they have controlling this product are either wrong or being ignored. There is a difference between what is supposed to be and what is sometimes, and this is one of those times. I take 30mg twice a day. I always wake up an hour early and take it, then go back to sleep so I wake up naturally. With ALV it would be 4 hours later instead of 45 minutes later. I went from a 4.0 GPA in 300 and 400 level classes to barely passing a 100 Level survey course. If it wasn't for the recent shortage and having to switch pharmacies, I would still be on ALV's trash pills.",
    "I have taken Adderall XR and short-acting for 25 years. I got this new XR 30mg the other day, Lannett, and it made me tired, heart racing, BP accelerated, and did NOTHING to help me focus. I contacted the pharmacy and my doctor, and he's trying to switch me to another brand because this is a joke. Awful.",
    "I've been taking 20mg IR Adderall for over a year for my ADHD, and it's worked wonders. I've tried TEVA and a couple of other generics, and they worked fine. However, this month, my prescription was filled with Alvogen generic amphetamine/dextroamphetamine, and let me tell you, it is horrible. After I take my 20mg dose, after 1 hour, I begin feeling tired and nauseous. I don't feel focused or motivated, I literally feel like I took a sleeping pill. This has never happened to me while taking Adderall until Alvogen brand. I will be reporting them to the FDA because this is NOT an acceptable substitute for Adderall.",
    "Teva Adderall is no longer effective after 5 years. The composition of the medication has definitely changed. This has affected me quite negatively, and I'm pretty sure it is a manufacturing issue. This needs to be corrected. Most of us take the medication because we need it, not because it's fun.",
    "I take two 30 mg pills a day for ADHD, and it has really made a huge difference in my life. I am able to focus on one task at a time and complete it. Works great for giving me the motivation I sometimes lack. Only issue is that when I was given the white or peach ones, they did not seem to work as well as the pink ones. Talked to the doctor about it, and she added to my prescription to only receive the pink ones. Curious if anyone else has had this issue.",
    "Adderall is literally the only thing that I have tried that has improved my life in the slightest. I have ADD and treatment-resistant depression. I got my Bachelor's degree in Health & Psychology. I tried every supplement, herb, nootropic, etc. I'm commenting here because of all the people saying how it drained them or over time began making them feel worse. You need to educate yourself. One of the most important things is to be sure to be supplementing with tyrosine daily. Tyrosine converts into dopamine, like how 5-HTP converts to serotonin. Just like how SSRI's eventually 'poop out' and stop working because they've used up the body's natural serotonin, Adderall will eventually 'poop out' on you and stop working. Yet, even worse when this happens, the more you take, the worse you feel because it's like revving an engine with no gasoline left in it. There's plenty more to look into, but even just taking tyrosine makes a huge difference!",
    "Generic Adderall varies significantly depending on manufacturing. The reason being, the FDA says the manufacturer only has to “demonstrate” it “works in the same way” as the brand-name, i.e. generic ingredients do not have to be the same, which is why so many don’t work and/or make people feel sick. In my experience, the only generic that works like the brand-name is Prasco, which acquired Teva’s generic XR in 2016. Few pharmacies use Prasco as their generic because it’s more expensive! My doctor specifies “Prasco generic only” on my prescription for D-Amphetamine ER 30MG Salt combo. By law, the pharmacy must comply if Prasco is one of their overall suppliers. My insurance changed, so I called Prasco to see if they sell to Costco. They do. It just takes a day or 2 for the pharmacist to order and fill my script. Walgreens used Prasco as their generic until recently. Now it’s Mallinckrodt, which just filed for bankruptcy to settle a slew of opioid lawsuits. It’s all about money.",
    "Teva Adderall IR 30mg is BAD as of February 2022. I’m shocked. It was one of the best generic brands forever. After 16 years of taking this, I’ve never had a problem with a generic brand (aside from Aurolife, aka Aurobindo, aka Northstar). I had no problem with Lannett, unlike others here. I’m falling asleep after I take it. I took an old Lannett I still had, and I’m back to normal. This is extremely frustrating; there’s nothing we can do about it.",
    "I’ve been diagnosed with ADHD and I’ve been taking generic Adderall for about 5 years or so, and it was AMAZING. I was able to get work done and also helped me greatly in accomplishing assignments during college. During the last year or so, I’ve noticed that Adderall wasn’t working as efficiently as it used to. I was unable to stay focused, had a hard time completing tasks, and it takes me longer to analyze or register information at work. I thought the generics were an issue, so I started taking the brand name Adderall by TEVA. Well, I’ve now come to terms that there is an issue with the manufacturers and/or the components of this prescription. It hasn’t worked the same and it has been affecting me negatively in my work life as well as my home life. Something needs to be looked into, I’m glad I’m not the only one seeing this problem. I now am looking into alternative/holistic medicine.",
    "I shared my experience recently on here and was going back over and reading others as well. I believe we should all state the laboratory that is producing the specific generic we are each taking. Doing so may help us all narrow down which ones to stay away from and which ones are truly therapeutic. Eon lab brand of amphetamine/dextroamphetamine was good until 9 months ago, now they are horrible (no therapeutic value and bad side effects). I then switched to Teva and they were decent for about 2 months and now they are giving me side effects. Plus, the pharmacy ran out of them and I had to wait for a new batch and when the new batch came in is when the bad side effect started. I KNOW the drug manufacturer has changed something. Hope that helps someone.",
    "Been getting Teva generic from different Walgreens locations for years. I’ve been complaining about the dose not lasting longer than a couple of hours, but this last refill doesn’t even work at all. I doubled my dose, and all I got was a headache and brain fog. I’m extremely hungry all day too. The pills don’t even have that nasty taste to them either. Teva was caught back in 2012 giving out ineffective antidepressants, so it seems they’re back to their old tricks. Going to report this to the FDA, and I hope others do too.",
    "Since being switched to the generic version of Adderall, Dextroamp-Amphetamine manufactured by Alvogen, I have been experiencing negative side effects for the past three days. I have become irritable, emotional, and easily agitated by noises, including music that I previously enjoyed. I have also been experiencing fatigue, lack of motivation, and difficulty reading. My speech has become slurred and confused, and I have developed tension headaches. I want my sparkle back, and I couldn't care less about anything. I’m surprised I’m writing this review as I am currently feeling scattered and embarrassed.",
    "I have been on Adderall 15mg 2x daily for 7 years. It has completely changed my life. I was always down, depressed, unmotivated, impulsive, always daydreaming, short attention span, no focus, and couldn't sit still. Adderall has given me a new happy life that I can enjoy and appreciate. I'm starting to think I need to go up to 20mg. I can feel I'm getting used to them. But without them, I wouldn't get out of bed and would waste my life. I think Adderall is my miracle drug. I have never been so grateful for a prescription drug.",
    "I cannot believe that the FDA allows AUROBINDO or TEVA to sell their lousy drugs through pharmacies in the US. Neither of these generics have any effect on me at all!! WASTE of money! They are playing with people's minds and well-being!",
    "Keep coming back to read reviews of the generics. I stopped my prescription 6 mos ago, not because the shortage but because whatever is in this medication now as opposed to the past is so horrible it’s not worth even taking! I was one of the lucky ones who took the original BARR formula. I was visiting my mother recently, I moved out of her home 15 years ago. Clothes, shoes, purses, etc. remain. You probably know where this is going. I searched through my old purses and found a bottle with two pills, SANDOZ, 2015!! I only took a pinch since I hadn't taken any in so long. OMG, I cannot believe how much better this old medicine works! So sad at the same time. I’m stretching it as much as I can and so depressed knowing this will probably be the last time I will ever feel like a functional human being again.",
    "If you're taking for ADHD please note there are a lot of side effects, having said this, they are sometimes serious so take note to talk to your doctor. If you get cold fingers or toes, make sure to consult your doctor as it's a syndrome that can be prevented. It does help with focus, it helps with impulse control, it helps with a general overall euphoric feeling and it can cause you to lose a lot of weight. Be sure to eat, EAT, don't shake your head, you know I'm talking to you. Eat and stay hydrated it causes you to urinate a LOT, make sure to supplement what you are losing. It will cause tremors, shakes, and irritability, again, eat food. Make sure to stick to a 2000 calorie diet AT LEAST. May cause muscle fatigue and extreme soreness, stay hydrated, make sure of this. Some say it causes better grades in school, well, to an extent. It just makes you write a lot. Eat Eat Hydrate And maybe take melatonin to help promote rest. I warned and entertained you.",
    "I was so glad to see these posts. Pharmacies are so rude to me. I switched to so many brands, but they say they are all alike, and say it doesn't matter which generic I get, because they're all the same. My doctor, unfortunately, thinks the same. I finally said to the pharmacy tech one day, 'I'm sure I'm not the only one who would like certain generics.' She said, no, I'm the only one. I know this sounds crazy, but the blue 10mg of Teva doesn't seem to work like the 15mg of the peach Teva, even if I cut one of the blue in half to make it 15mg.",
    "Completely agree, something is different with Adderall. It doesn't matter if it's name brand or if it's generic. One day, they will work like Adderall is supposed to work, and the next day, it's not working... and no, it's not my tolerance.",
    "I have found the generic brand for Adderall is not as effective as the brand name. The Epic brand caused me to have severe depression, blurred vision, headaches, feeling very tired, and no focus at all. I’m trying to find a brand that is more similar to the name brand. Looking for suggestions if anyone can share, please. Thanks.",
    "First prescribed it in grad school for ADD & depression. Worked wonders. Only downside is I became very reliant on it. Was stuck between the two evils of being a depressed zombie (w/o taking it) and feeling like a happy, motivated, focused person (on Adderall). Eventually stopped taking and failed out of grad school. Work was hard, always late, made stupid mistakes, & couldn’t complete tasks. 3 years & 3 jobs later, I broke down and went back to a doctor who rediagnosed me with ADD, Anxiety, & Depression. I was reluctant to start back on Adderall and tried a few alternatives first. Everything made me feel even MORE exhausted, back on Adderall 30mg day, feel normal again. I have the motivation, energy, & focus to complete tasks. Only complaint is anxiety which I resolve w/ a low benzo & exercise. Remember, there’s no reason to be miserable if there’s a pill out there that can change your life.",
    "If anyone else is having a terrible time with the new Lannett generic Adderall, you can report this to the FDA. I have been having crippling headaches, stomach aches, and the medication doesn’t even feel like it works!!! I get tired after I take it and then can’t sleep all night because of it. HORRIBLE. Google FDA MedWatch online reporting to fill in the form.",
    "Many Adderall/Amp-Dex tablets before 2020 worked great, especially Teva & Sandoz & occasionally Core. I can honestly say from 2020 to now that they've either taken out half the amount of drug per total mg and replaced it with cheap fillers, or taken the entire drug out and filled it with sugar. Look at the most helpful replies on here, all but one are from 2019 and before. If we’re all experiencing the same problems, the issue is the manufacturers, not any of us. This needs to be fixed.",
    "Since the shortage, Teva is definitely leaving something out or substituting ingredients. That is the problem. I have been struggling for months because these new pills are a joke. I just ran across a few that I had left from before the shortage, took one, and bam... worked like a charm. That's definitely proof that this is NOT a tolerance issue. TEVA shame on you. This is not a joke for those of us who have to take this medication to function in our daily lives.",
    "Generic Adderall: TEVA vs. ALVOGEN. All generic Adderall is NOT the same, trust me! I don't care what your physician or pharmacist may say. I've taken Adderall for nearly 25 plus years for ADD. Why? It works twice as good. Ask anyone who's taken different brands before. For the best quality and most potent Adderall on the market, it is made by a company called TEVA. Even pharmacists tell me that when they run out of TEVA and must use ALVOGEN, their patients complain because pharmacies cannot keep TEVA in stock. Consumers know it's the best and most effective for ADD and ADHD.",
    "Been taking Adderall and generics for 25 years. I just spent a year on the ALV manufacturer of amphetamine with dextroamphetamine and everything took a nosedive. GPA went down, personal life, and just general capacity for life. Ended up with some acute OCD due to some other factors. Switched back to TEVA and I'm instantly clearer. Whatever FDA regulations they have controlling this product are either wrong or being ignored. There is a difference between what is supposed to be and what is sometimes, and this is one of those times. I take 30mg twice a day. I always wake up an hour early and take it, then go back to sleep so I wake up naturally. With ALV it would be 4 hours later instead of 45 minutes later. I went from a 4.0 GPA in 300 and 400 level classes to barely passing a 100 Level survey course. If it wasn't for the recent shortage and having to switch pharmacies, I would still be on ALV's trash pills.",
    "I have taken Adderall XR and short-acting for 25 years. I got this new XR 30mg the other day, Lannett, and it made me tired, heart racing, BP accelerated, and did NOTHING to help me focus. I contacted the pharmacy and my doctor, and he's trying to switch me to another brand because this is a joke. Awful.",
    "I've been taking 20mg IR Adderall for over a year for my ADHD, and it's worked wonders. I've tried TEVA and a couple of other generics, and they worked fine. However, this month, my prescription was filled with Alvogen generic amphetamine/dextroamphetamine, and let me tell you, it is horrible. After I take my 20mg dose, after 1 hour, I begin feeling tired and nauseous. I don't feel focused or motivated, I literally feel like I took a sleeping pill. This has never happened to me while taking Adderall until Alvogen brand. I will be reporting them to the FDA because this is NOT an acceptable substitute for Adderall.",
    "Teva Adderall is no longer effective after 5 years. The composition of the medication has definitely changed. This has affected me quite negatively, and I'm pretty sure it is a manufacturing issue. This needs to be corrected. Most of us take the medication because we need it, not because it's fun.",
    "I take two 30 mg pills a day for ADHD, and it has really made a huge difference in my life. I am able to focus on one task at a time and complete it. Works great for giving me the motivation I sometimes lack. Only issue is that when I was given the white or peach ones, they did not seem to work as well as the pink ones. Talked to the doctor about it, and she added to my prescription to only receive the pink ones. Curious if anyone else has had this issue.",
    "Adderall is literally the only thing that I have tried that has improved my life in the slightest. I have ADD and treatment-resistant depression. I got my Bachelor's degree in Health & Psychology. I tried every supplement, herb, nootropic, etc. I'm commenting here because of all the people saying how it drained them or over time began making them feel worse. You need to educate yourself. One of the most important things is to be sure to be supplementing with tyrosine daily. Tyrosine converts into dopamine, like how 5-HTP converts to serotonin. Just like how SSRI's eventually 'poop out' and stop working because they've used up the body's natural serotonin, Adderall will eventually 'poop out' on you and stop working. Yet, even worse when this happens, the more you take, the worse you feel because it's like revving an engine with no gasoline left in it. There's plenty more to look into, but even just taking tyrosine makes a huge difference!",
    "Generic Adderall varies significantly depending on manufacturing. The reason being, the FDA says the manufacturer only has to “demonstrate” it “works in the same way” as the brand-name, i.e. generic ingredients do not have to be the same, which is why so many don’t work and/or make people feel sick. In my experience, the only generic that works like the brand-name is Prasco, which acquired Teva’s generic XR in 2016. Few pharmacies use Prasco as their generic because it’s more expensive! My doctor specifies “Prasco generic only” on my prescription for D-Amphetamine ER 30MG Salt combo. By law, the pharmacy must comply if Prasco is one of their overall suppliers. My insurance changed, so I called Prasco to see if they sell to Costco. They do. It just takes a day or 2 for the pharmacist to order and fill my script. Walgreens used Prasco as their generic until recently. Now it’s Mallinckrodt, which just filed for bankruptcy to settle a slew of opioid lawsuits. It’s all about money.",
    "Teva Adderall IR 30mg is BAD as of February 2022. I’m shocked. It was one of the best generic brands forever. After 16 years of taking this, I’ve never had a problem with a generic brand (aside from Aurolife, aka Aurobindo, aka Northstar). I had no problem with Lannett, unlike others here. I’m falling asleep after I take it. I took an old Lannett I still had, and I’m back to normal. This is extremely frustrating; there’s nothing we can do about it.",
    "I’ve been diagnosed with ADHD and I’ve been taking generic Adderall for about 5 years or so, and it was AMAZING. I was able to get work done and also helped me greatly in accomplishing assignments during college. During the last year or so, I’ve noticed that Adderall wasn’t working as efficiently as it used to. I was unable to stay focused, had a hard time completing tasks, and it takes me longer to analyze or register information at work. I thought the generics were an issue, so I started taking the brand name Adderall by TEVA. Well, I’ve now come to terms that there is an issue with the manufacturers and/or the components of this prescription. It hasn’t worked the same and it has been affecting me negatively in my work life as well as my home life. Something needs to be looked into, I’m glad I’m not the only one seeing this problem. I now am looking into alternative/holistic medicine.",
    "I shared my experience recently on here and was going back over and reading others as well. I believe we should all state the laboratory that is producing the specific generic we are each taking. Doing so may help us all narrow down which ones to stay away from and which ones are truly therapeutic. Eon lab brand of amphetamine/dextroamphetamine was good until 9 months ago, now they are horrible (no therapeutic value and bad side effects). I then switched to Teva and they were decent for about 2 months and now they are giving me side effects. Plus, the pharmacy ran out of them and I had to wait for a new batch and when the new batch came in is when the bad side effect started. I KNOW the drug manufacturer has changed something. Hope that helps someone.",
    "Been getting Teva generic from different Walgreens locations for years. I’ve been complaining about the dose not lasting longer than a couple of hours, but this last refill doesn’t even work at all. I doubled my dose, and all I got was a headache and brain fog. I’m extremely hungry all day too. The pills don’t even have that nasty taste to them either. Teva was caught back in 2012 giving out ineffective antidepressants, so it seems they’re back to their old tricks. Going to report this to the FDA, and I hope others do too.",
    "Since being switched to the generic version of Adderall, Dextroamp-Amphetamine manufactured by Alvogen, I have been experiencing negative side effects for the past three days. I have become irritable, emotional, and easily agitated by noises, including music that I previously enjoyed. I have also been experiencing fatigue, lack of motivation, and difficulty reading. My speech has become slurred and confused, and I have developed tension headaches. I want my sparkle back, and I couldn't care less about anything. I’m surprised I’m writing this review as I am currently feeling scattered and embarrassed.",
    "I have been on Adderall 15mg 2x daily for 7 years. It has completely changed my life. I was always down, depressed, unmotivated, impulsive, always daydreaming, short attention span, no focus, and couldn't sit still. Adderall has given me a new happy life that I can enjoy and appreciate. I'm starting to think I need to go up to 20mg. I can feel I'm getting used to them. But without them, I wouldn't get out of bed and would waste my life. I think Adderall is my miracle drug. I have never been so grateful for a prescription drug.",
    "I cannot believe that the FDA allows AUROBINDO or TEVA to sell their lousy drugs through pharmacies in the US. Neither of these generics have any effect on me at all!! WASTE of money! They are playing with people's minds and well-being!",
    "Keep coming back to read reviews of the generics. I stopped my prescription 6 mos ago, not because the shortage but because whatever is in this medication now as opposed to the past is so horrible it’s not worth even taking! I was one of the lucky ones who took the original BARR formula. I was visiting my mother recently, I moved out of her home 15 years ago. Clothes, shoes, purses, etc. remain. You probably know where this is going. I searched through my old purses and found a bottle with two pills, SANDOZ, 2015!! I only took a pinch since I hadn't taken any in so long. OMG, I cannot believe how much better this old medicine works! So sad at the same time. I’m stretching it as much as I can and so depressed knowing this will probably be the last time I will ever feel like a functional human being again.",
    "If you're taking for ADHD please note there are a lot of side effects, having said this, they are sometimes serious so take note to talk to your doctor. If you get cold fingers or toes, make sure to consult your doctor as it's a syndrome that can be prevented. It does help with focus, it helps with impulse control, it helps with a general overall euphoric feeling and it can cause you to lose a lot of weight. Be sure to eat, EAT, don't shake your head, you know I'm talking to you. Eat and stay hydrated it causes you to urinate a LOT, make sure to supplement what you are losing. It will cause tremors, shakes, and irritability, again, eat food. Make sure to stick to a 2000 calorie diet AT LEAST. May cause muscle fatigue and extreme soreness, stay hydrated, make sure of this. Some say it causes better grades in school, well, to an extent. It just makes you write a lot. Eat Eat Hydrate And maybe take melatonin to help promote rest. I warned and entertained you.",
    "I was so glad to see these posts. Pharmacies are so rude to me. I switched to so many brands, but they say they are all alike, and say it doesn't matter which generic I get, because they're all the same. My doctor, unfortunately, thinks the same. I finally said to the pharmacy tech one day, 'I'm sure I'm not the only one who would like certain generics.' She said, no, I'm the only one. I know this sounds crazy, but the blue 10mg of Teva doesn't seem to work like the 15mg of the peach Teva, even if I cut one of the blue in half to make it 15mg.",
    "Completely agree, something is different with Adderall. It doesn't matter if it's name brand or if it's generic. One day, they will work like Adderall is supposed to work, and the next day, it's not working... and no, it's not my tolerance.",
    "I have found the generic brand for Adderall is not as effective as the brand name. The Epic brand caused me to have severe depression, blurred vision, headaches, feeling very tired, and no focus at all. I’m trying to find a brand that is more similar to the name brand. Looking for suggestions if anyone can share, please. Thanks.",
    "First prescribed it in grad school for ADD & depression. Worked wonders. Only downside is I became very reliant on it. Was stuck between the two evils of being a depressed zombie (w/o taking it) and feeling like a happy, motivated, focused person (on Adderall). Eventually stopped taking and failed out of grad school. Work was hard, always late, made stupid mistakes, & couldn’t complete tasks. 3 years & 3 jobs later, I broke down and went back to a doctor who rediagnosed me with ADD, Anxiety, & Depression. I was reluctant to start back on Adderall and tried a few alternatives first. Everything made me feel even MORE exhausted, back on Adderall 30mg day, feel normal again. I have the motivation, energy, & focus to complete tasks. Only complaint is anxiety which I resolve w/ a low benzo & exercise. Remember, there’s no reason to be miserable if there’s a pill out there that can change your life.",
    "I've read some of the comments comparing this medication to 'street meth.' That is simply not true and further stigmatizes Adult ADHD, since many still inaccurately claim it's something you grow out of. Well, it isn't, and my childhood ADHD went untreated, and I could barely function at school. Since taking a combo of Adderall and Wellbutrin, my brain and my life are no longer a disorganized mess. As a kid, I was an untreated C+ student, and as an adult, I have a Ph.D. I regret the years I wasn't helped. Medication plus cognitive behavioral therapy plus Adult ADD support groups = a better me. If the medicine doesn't work for you, that is your individual response, but it doesn't represent all of us.",
    "Adderall is the most incredible drug for ADHD - if you take the BRAND NAME. I have noticed that many of the generics out there are wildly different; some work just fine, others have weird side effects, and others have zero effect whatsoever. I told my psychiatrist about this, and he simply wrote up a DAW (Dispense As Written) order to the pharmacy, and now they are not allowed to fill my medication with anything except for the brand name. Because I tried the generic and it didn't help, my insurance went ahead and covered the brand name Adderall. Yes, you will pay a higher copay, and it's not cheap - but if you have ADHD, the slightly higher copay that you will need to spend on the best possible medication is 100% worth it. The actual brand name Adderall tablets are the most consistent pills that I've taken. SWITCH TO BRAND NAME. The generic company labs need to be criminally investigated for deliberately altering pill formulas to increase profits!!",
    "I take Adderall IR 10 mg twice a day for narcolepsy and ADHD. I use Walgreens and normally get generic Teva. The past few months I have noticed the meds have not been as effective. Dr. increased my dosage and still no difference. The last bottle I got felt like I hadn’t taken my meds at all. Something sketchy is definitely going on.",
    "Adderall is usually extremely helpful for me and is probably the only thing that allows me to be a productive member of society and run my own business. However, now there are so many horrible generics out there. Just received a new amphetamine/dextroamphetamine generic made by Sunrise Pharmaceuticals. It makes me feel WAY WORSE than taking nothing at all. Why are there so many bad generics being dispensed these days? Aren't these drugs batch tested for accuracy and efficacy? Somehow, I highly doubt this stuff is real.",
    "Adderall (amphetamine salts, generic Teva) has always worked well for me. Recently, I had to start taking the Lannett generic due to the shortage, and it has been HORRIBLE. I’m jittery, anxious, and depressed. This stuff is like poison. Please write a complaint to the FDA MedWatch if you or anyone you know is having issues as well. It’s so frustrating.",
    "I recently was given this new form of Adderall from the pharmacy, which was circular with just an 'A' on one side. I did not like this new form of Adderall at all! I assumed it would have the same effect as the typical oval shaped one, but it was completely different, which is a little scary. It was very bitter and gross tasting, unlike the football-shaped one that has a sweet note. It also disintegrated, turning to powder immediately, as I attempted to break it in half (waste of product). I did not get any focus from it, nor did I feel any different at all. It did nothing! Then the next day, I got a horrible headache! I was talking with a friend who also mentioned getting the same thing recently. He mentioned having an extremely bad headache too the following day, so we now know it's from this form of Adderall. I DO NOT LIKE IT. It should be pulled from the market, honestly. I don't know what the heck this rubbish is, but it is not Adderall.",
    "I've taken Adderall for 9 years. When I was 1st prescribed Teva 30 mg. tablets, they were definitely more powerful and bright orange. That is definitely not the case now. They are a much lighter shade of orange now and definitely not the same mg. strength. And by the way, dear FDA and your buddies at the DEA, rather than keeping a chokehold on those of us that simply want access to quality medication, you might want to take a look at how the mg. strength has definitely been reduced across the board on at least Adderall. Also, there is a generic brand made by a company called Aurobindo out of India - it's pure garbage. You (DEA and FDA) are the ones trying to control us, not help us. No one with a genuine medical condition and a genuine prescription should have to deal with the stress of having to find this medication from month to month. Does Adderall work for my mild ADHD and depression? Yes, not as effectively as before, but yes, it does help.",
    "Alvogen Adderall is horrible. Not only does it not work for my ADHD symptoms, but it also makes me feel down and tired, and I already suffer from chronic fatigue. 20 mg of Alvogen doesn't come close to 5 mg of TEVA or SANDOZ. Now I know why CVS had Alvogen Adderall in stock during this shortage - people probably ask and refuse to fill it. I would rather take nothing at all than Alvogen. There is a huge chasm of quality among generic Adderall manufacturers.",
    "I've been in the middle of this shortage and have been going through whatever brand of generic the pharmacy has on hand. So as of now, I have experience with Sandoz, Mallinckrodt, Teva, Shire, Camber, and Rhodes brand 10mg Generic Adderall IR. Now, each of them has varying levels of side effects, some more than others, however, each of them has had the same effect as the other medications in the same dosage of 10mg. Except for Teva, which now if I had to guess, instead of the 10mg Blue IR Adderall manufactured by Teva. Instead of 10mg in these pills which are labeled for 10mg, I can guarantee you if I took it to a lab and had it analyzed, there is probably only 5-6mg of mixed amphetamine salts contained in each pill. Something has happened with the Teva brand that the FDA needs to look into, these medications are life-saving and necessary for those with ADHD in order to function and not cost society $300 billion in damages a year alone due to untreated ADHD.",
    "The last three reviews are about how Teva Adderall is bad quality. I agree! I mean, dramatically bad. I’ve fallen asleep twice during the day since I filled it, and my watch says my heart rate is low too. Usually it is normal. I have made no changes to anything. What is going on? Can we do anything or do we just have to deal with it? Teva has always been decent. Actually, I don’t even notice generic brands until now, and I realized I’ve been getting Lannett until this refill. What happened to Teva?",
    "I take the 10 mg amphetamine with dextroamphetamine by Teva and it works great, better than the 15 mg, in my opinion. I see others mentioning generics by Allogen and Mallinckrodt here. Well, I take a couple of other medications manufactured by these 2, on and off, most times it's Mallinckrodt. Let me tell you, this is the WORST drug manufacturer on the market. The Allogen is junk too. I've been on a few medical chat sites just to see what I can find out about Mallinckrodt and see if others felt the same way, and they absolutely do! Literally 100's of people have complained to the company itself and to the FDA. This has been going on for a solid 5 years at least, and the stuff is STILL pure unadulterated JUNK.",
    "I always knew I was different from everyone else. I was very quiet and shy. But in my mind, I couldn't shut up. My mind was loud. In class, I could never stop fidgeting, playing with my hair, scratching an itch, doodling on notebooks. I wondered why nobody else squirmed around like me. At 24, I was diagnosed with ADD. Adderall is life changing. I'm finally normal. I feel like everyone else. My mind is at ease. I am in charge of my thoughts. I can have genuine conversations with people without my mind wandering. I am finally happy after years of struggles. I am organized and more peaceful.",
    "I have been taking Adderall for a long time. ADHD doesn't just go away. The only issue I've been experiencing is not knowing when or if I'll be able to pick up my prescription when it's due. I haven't seen a Teva or Sandoz in two years or more. My prescription is filled with something different every month. My system seems confused, I don't respond very well to some of the replacements I've been dispensed. I'm grateful my pharmacist goes the extra mile to find my medication. Unfortunately, different manufacturers produce different results. Without this medication, I can't focus or read. The simple things in life become impossible. I would like to see an end to this shortage, for me, receiving the same manufacturer of Adderall month to month is very important. It may be hard for some to understand, but it's a reality for me. Let's fix this problem of Adderall not being available. For anyone who doesn't have ADHD or narcolepsy, it's not possible for them to understand.",
    "I’m 48-year-old woman that was diagnosed with ADHD in elementary school. When I began (on holiday) taking it, I’m extremely fatigued/zombie the first 3 days. I am not nearly as engaged with anyone/anything around me (I talk 97% less when I’m on Adderall) and it makes me feel less cognitive. I feel like it dumbs me down. After the 3rd day, I start to feel better and those 'tranquilizer effects' go away. Adderall is an emotional regulator for me. It works wonders for my impulsivity, racing thoughts, fidgeting, feeling overwhelmed, anger, anxiety, zoning out, and my mouth. Yes, my mouth has always been my biggest challenge and has caused me tremendous social/professional problems. While in a perfect world I’d be on no medication, I have to recommend Adderall for anyone who's suffering from ADHD, because it has changed my overall quality of life for the best. Sparkle on, beautiful people!",
    "I've been on Adderall for 9 years, and this shortage has made life miserable. For people who need it to get through daily life, we're the people suffering the most. Teva was always the best generic, but I haven't been able to find Teva for a year or more. The Rhodes kind and the Lannett kind are both terrible! The efficacy of both of those brands is extremely low, like they are just sugar pills. Plus, they've increased my anxiety and increased my number of regular headaches. The powers that be need to get this situation under control, or lots of us who struggle with ADHD and other comorbidities aren't going to make it out alive. Literally. The depression I've struggled with for most of my life has been more severe for the last year, even though I'm still treated for it by my psychiatrist! We are real people with prescriptions from real doctors who deserve consideration! And our meds!",
    "Have taken Adderall on and off for around 13 years for ADD and CFS. I was lucky enough to have tried the 'real' brand Adderall by Barr Laboratories. I’ve never taken over 20mg a day. This medicine has gone to trash. The only negative side effect from the Barr version was occasional jaw clenching. I think Teva must’ve burned the patent formula or something because it has never worked like the Barr, not even close. So many negative side effects (migraine headaches, heartburn, nausea)! I keep hoping at some point they might magically start producing a decent version that actually helps instead of hurts. The original Barr had true therapeutic value. Eon Labs produced a decent generic for a while, but bam, it suddenly went to garbage at the end of 2018. So switched back to Teva a couple months back and it started okay (not as good as Eon but better than everything else out there), then last month's refill is feeling like they’re changing to something bad too. Bring back real Adderall!",
    "After 37 years of knowing something wasn't right with my brain, I was diagnosed with ADHD, Inattentive Type in grad school and was prescribed Adderall. Where do I start??? This medication literally changed my life. Imagine being a 'gifted' kid who eventually could barely pass middle school math - that's me. After a lifetime of compensating for my 'slow processing', hiding my disorganization, and pretending to be on the same page with everyone else, this explains everything. Adderall has made a NIGHT AND DAY difference in my motivation level, what I understand and follow, and even my mood/emotional reactivity. In a word, amazing. If I ever meet the people who 'discovered' Adderall, I'm kissing them - my husband agrees.",
    "During school, I struggled with learning, despite hard work, I barely graduated. By the time I reached high school, I wanted to give up. As an adult, I experienced the same difficulties in employment. I became depressed and almost gave up. Fortunately, I was tested for ADHD. Diagnosis revealed severe ADHD. Within an hour of taking the first dosage, my brain seemed to turn on and function at its optimum potential. I felt truly alert, focused, and clear-headed. I found I could complete tasks competently. Without Adderall, I'm useless. Adderall has improved my focus, ability, and competency in every aspect of life. It's a battery for my brain. I am dependent on Adderall for full functioning capacity. My well-being and livelihood are compromised without this medicine.",
    "Teva and Sandoz Adderall taste sweet and work well. I had to get Alvogen this month, and they taste horrible, along with not even working. This sucks bad. It's been giving me Raynaud's and headaches, with no energy and no focus. I can't go 5 minutes without hopping on my phone to avoid what I'm supposed to be working on. If I could buy Teva right now from someone on the street until my next script, I would do it immediately. I swear I'm gonna take these Alvogen somewhere to have them tested. Teva/Sandoz - 10 stars. Alvogen - 10.",
    "I got diagnosed with ADHD at the beginning of this school year, being my senior year of high school. Since 8th grade, I've struggled in school, been incredibly impulsive, had very strange eating habits, overthought everything, and could never contain my anger or anxiety. Once prescribed, my life has changed. My grades went up, and in 3 months I've lost almost 30 pounds (I am still in the normal BMI range). I can control myself. I finally believe in myself because of Adderall.",
    "I was diagnosed with adult ADHD last summer. I had it my entire life but only realized it about 2 years ago when I started reading the DSM-5 manual (that light bulb switched on!). I have tried Vyvanse, Astarys, and Adderall XR and IR. I prefer the Adderall IR because I can partially dose on an as-needed basis, but it has improved my life and work performance immeasurably. I have taken Metoprolol for a little over 3 years and the combo worked great until about 3 weeks ago when I started getting heart palpitations, high BP, cramps, etc. After a little research (I’m a Ph.D. - research is my game), I concluded that for whatever reason my potassium levels were low. I started eating bananas, peanut butter, electrolytes, taking magnesium and potassium citrate, etc., and everything improved within 48 hours. Not sure if Adderall slowly sucks nutrients out of your system. Apart from that episode, Adderall has been great. I recommend Arginine, beets & Citrulline with it. Male, 46, 225 lbs.",
    "Lannett is horrible. Good to see so many agree. My CVS and Walgreens claim it's the only mfg they can get. This is just wrong. Sandoz was by far the best. My pharmacist would order it for me, now it's only Lannett! To expect a patient to accept what they're given without choice is absurd. If all of us contact the FDA, they may pay attention. And each state or region has an FDA Consumer Complaint Coordinator. The form looks daunting but is not that difficult. Google FDA consumer complaint form and go from there. Strength in numbers! We can sit around and complain, but that is not going to make the change. Good luck!",
    "I have been on Adderall XR for 21 years. Three months ago, my script was filled with Lannett 'generic' XR. I have taken Teva generic and had no issues, so wasn't concerned. At about the same time, I started having issues with depression, body aches, and brain fog. About two months later, I started an anti-depressant because I thought I was just depressed. I ended up being allergic to the anti-depressant, so had to get off of it. Following that, the symptoms just got worse, at one point, I didn't get out of bed for a week. By chance, I didn't take the Lannett XR, and I noticed a significant change in how I felt. I switched to a different manufacturer because only Lannett XR was available (due to the Teva outage). Within two days of being on that, my symptoms significantly improved. The next month, I decided to pay out of pocket for brand XR, and all the symptoms went away. Lannett is awful, I'm not sure what the FDA approved here as a 'generic,' but for me, it was horrible and led to major depressive disorder.",
    "DO NOT TAKE THE LANNETT, ELI-515. If you struggle with anxiety, depression, I wouldn't recommend this. I was given it, it is not Adderall. It’s a therapeutic equivalent. My other meds stayed the same, my routine, diet, except for getting this. It has rendered me completely hopeless, crippling depression, lethargic, overwhelmingly anxious, my stomach is churning non-stop, so I cannot even eat on it without getting violently ill. I saw my psych after a week on it, for 6 days, thinking it was Adderall and I was just doing something wrong. I told my psych the pill description and how it made me feel, he looked it up and said, “No, you’re not making any of this up, this isn’t the correct medication, but unfortunately, the pharmacy input it as Adderall, so legally we can’t do much about it.” I have flushed it down the toilet. If you receive these at a pharmacy, please speak to the pharmacist directly about it.",
    "Adderall has totally brought my life into focus. I started taking it about 6 months ago. I'm 39 now and really wish I had this medicine as a kid. In addition to ADD, I had severe anxiety and depression as a child/teenager. Adderall has given me focus, lifted my general mood, taken my anxiety away, and made me a productive human being. I'm actually starting my own business! The only bad thing is that you really have to be careful of how much you take because it can have the opposite effect, i.e., severe anxiety and no focus, but if you take it the right way, it will change your life! One other bad thing is the stigma surrounding the medicine and being treated like an addict by some pharmacists.",
    "I have been diagnosed with ADD. I have always pushed myself to get good grades and to take as many AP and honors classes as I can handle. I enjoy learning about new things; however, my lack of focus got in the way of my learning. It bothers me when people say ADD/ADHD is made up. I know that people who don't have this disorder can't truly understand what it's like. Without Adderall, my mind is foggy, and I can't take the fog away to learn about the things that I love. All my friends know that I have a strong passion for physics and astronomy, but it's very hard for me to pick up a book without forgetting most of what I read after I finished it. On Adderall, I feel like the fog fades away and my mind is like a clear sunny day. Oh, how I wish that I didn't have to take this every day and just naturally be as focused. I am just an 18-year-old who is trying to pursue her dreams, but without this medication, I'm not sure how I can get through college to learn what I love. I can now look through my telescope at the stars without the clouds getting in the way.",
    "I’ve been taking the generic version of Adderall for about 2 years now. I was tired all the time and couldn’t focus. I felt like a slug, and when I had energy, I still had brain fog and had a hard time studying. In class, I would fidget in my chair, doodle, and listen to lectures, but nothing would stick in my head, no matter how long I studied. I was prescribed the 7.5 mg tablet once a day, and just the small dose did wonders for my energy levels and let me focus and actually get things done. It helped me talk in social situations and gave me a mood boost. That being said, the generics changed a couple of times. And I’m not sure, but I think I can tell a difference between them. After the pill wears off, my head aches, my legs throb, my body aches, and I’m nauseous and feel sick. I have flu-like symptoms, which are miserable. It’s sad because it’s a really small dose and helps me so much, but some of the side effects suck. You just gotta see what’s worth it to you.",
    "Glad I'm not alone with my experience of the different manufacturers. Core brand is by far the best brand I've experienced, but of course, it's been discontinued for years. I've tried at least 10 different brands and they're all different. Some put me to sleep or make me nauseous, some last for up to 20 hours while not helping at all with concentration, some make my heart race. Today, if I can't get Northstar, I'm not going to fill my prescription. Shame on the FDA for not listening to us.",
    "I have been taking Adderall for two years and it has probably saved my life. I had been misdiagnosed as bipolar with no comorbid ADHD, and was prescribed benzodiazepines and antidepressants. I eventually became suicidal when Abilify was added, and was lucky enough to have a moment of clarity and changed doctors and hospital affiliates. The week I was started on ADHD meds, I started to become the person I should be. I only wish I could have been diagnosed as a child, I feel I missed half my education. I can now focus all day, keep a train of thought long enough to finish mundane to complex tasks, and have written and recorded an album of music that had been completed but in disarray. No side effects, no weight loss or changes in eating habits.",
    "All the generics are horrible. Teva, who acquired Barr, has not improved. The brand is Teva - generic does not work. I want something comparable to original Barr. I'm struggling and drowning back into depression - generics are not the same. FDA doing nothing to help all of us that are struggling.",
    "Adderall has worked great for me when taken as needed. When I was in my early 20s and taking it daily, I built up a dependence that led to terrible withdrawals, as it is very addictive. (Learned the hard way and never want to go through that again!) I will usually only take this when my ADHD symptoms are unbearable and my work/personal life starts to become affected. We are talking maybe 1-4 tablets max per month. It really does help with focus and energy, and I find that one 10-20 mg dose is usually enough, and I feel good for several days after the dose without any withdrawals or dependence issues.",
    "I was 23 when I was diagnosed with ADHD. Started Adderall. I take 30 mg of SR a day and the difference is phenomenal! I get up with ease because I know I can tackle all tasks with astounding motivation and actually enjoy doing tedious work. I am co-morbid with anxiety, rumination, and I was highly neurotic. I found myself aggressive, quick-tempered, and easily abusing marijuana and alcohol. This all changed with Adderall. I am rational, reflect on situations in a positive light, and generally just a more helpful and kind person. Adderall completely saved my professional and personal life. Side note, it can cause erectile dysfunction, but it will go away after your body is used to the cycle.",
    "Lannett XR made me feel the same way all of you did. My pulse was racing. I couldn't find the motivation within me to do anything. I felt flat and emotionless. I was overall just highly sedated. It also caused horrible stomach aches and headaches. The dizziness was unbearable, as was staying up for hours at a time with no clear task in sight.",
    "Adderall is effective, but it comes with consequences. Both to your physical and mental health. I am 27 years old, I have taken Adderall on and off for about 10 years. Started it my freshman year of college. It was AMAZING at first! Lost that freshman 15, got straight A's, actually ENJOYED my work. Then I started noticing the crash symptoms. Tired, withdrawn, emotionless, sleepless. I stopped taking it because I hated the way it made me feel, but I realized how much more productive I am when taking it. When I start taking it again my immune system is shot, I'm constantly sick with something, I get super irritable. When I don't take it I can barely get out of bed and I always gain weight, which always sucks. It's a vicious cycle.",
    "Well, I had a hard time getting my regular generic Adderall refill a few months ago. So I went to a mom-and-pop pharmacy rather than Walgreens because they had it in stock. It cost me $60 rather than $5, but at this point, I had been without it for almost 2 weeks waiting on Walgreens to get the drug in stock. Fast forward 2 months and 2 prescriptions later, and I decided to try Walgreens again… Woohoo! I got it for $5. Only to come home and find out it was CAMBER! I tried it. I have been so sick. I feel loopy and extremely nauseous, and all I want to do is sleep. Since it is the weekend, there is nothing I can do. Tomorrow I am calling my doctor to let him know and seeing if I can turn in my prescription to Walgreens and have it sent back to the mom-and-pop pharmacy. I have been on 20 mg with 10 in the afternoon for 10+ years. I have never experienced this other than when my local CVS switched to Aurobindo, that also made me feel very ill.",
    "This drug is one of the greatest formulas of all time. I went from down and depressed and unmotivated to organized and focused. Also, from relatively poor to rich due to the effect it had on me with my enthusiasm for work.",
    "I started Adderall on April 16th of this year and it's been nothing short of a blessing. I can focus, work harder, do my due diligence on literally anything now, and it helps me not hate myself. Adderall IR works for me in about an hour (even on an empty stomach or full, doesn't matter for me at least) and covers me till about 10-11 p.m. surprisingly. I've only had the TEVA manufacturer so I haven't had the Lanett issues yet. I compare Adderall to putting on noise-canceling headphones and just getting stuff done. I'm a new man and I'm ready to push my life forward, hopefully, it keeps helping. I wish everyone luck on their medication journey.",
    "Such an amazing contribution to the pharmaceutical world. So much better than its ugly step-sisters, such as Ritalin and Vyvanse. Adderall steals the show every time. 30mg/day does the trick. Been on it for 12 years, I've taken personal breaks for tolerance. I've never had any type of 'withdrawal' or 'come downs' at the end of the day. This drug has the ability to put me to sleep when I take it, honestly; and that's because my dissociation (caused by my ADHD) causes my anxiety to skyrocket. But when I take my Adderall, I am able to focus on reality, making my anxiety disappear for a few hours. Calms me down. Relief is a blessing.",
    "I just filled with brand Shire XR, totally different from last month's brand Shire XR, which were finally acceptable. These are like Lannett innards, make me sick and trigger migraines, as well as another month of Teva generic tablets, which are absolutely disgusting and unacceptable. This is total rubbish; someone needs to produce real Adderall again using the old Barr/Teva recipe and the original Shire XR recipe. Over $7 a capsule for rubbish! Not refundable, can't trade them in. This is the definition of highway robbery! How can the same brand vary so much from one fill to the next? And these are the brands that have been the standard forever. Apparently, once you report more than two adverse reactions to a company, they don't have to respond back either. Not that they do anything but repeat back the same information to you; yeah, I know that part, I'm the one who wrote it! Tell me what I don't know! The FDA is no help either.",
    "When I was in grade school I had a real hard time learning. I could not pay attention in class. My mind was always wandering. I was always daydreaming and looking out the windows. I could not retain any information. I was forgetful and bored. My grades were always C's and D's no matter how hard I tried. I was always fidgety, had a hard time sitting still, always twirling my hair or shaking my legs or feet. I hated school, I felt so dumb. As I got into high school I was so far behind I gave up trying. When I started driving I would go through red lights, stop signs, etc. I was just daydreaming all the time. I kept losing my car keys, my glasses, forgetting where I put them. I am out of space, but Adderall saved my life! I am 59. No side effects.",
    "I have been taking it for several years. There was a time about a year ago when all the pharmacies could not get any, and I went about a month without. Being a Service Advisor, I deal with a lot of numbers (VIN, License Plates, etc.). After a few days without, I started reversing a lot of the numbers. I would see the correct order but would say out loud or write down a reversed version. I had to go slower and double-check what I had written. A positive side effect is it gets me off the couch on the day(s) I have off and motivates me to get stuff done around the house that needs to be done. It kept me up at night at first, but after a while, I learned not to take it too late in the day. I would recommend it to anyone who has ADHD.",
    "I have suffered severe ADHD my entire life. I barely graduated high school. I was scared to take Adderall because I was scared I would lose my personality and be a shell of a person. That did not happen, I am the best version of myself I've ever been. Don't expect this to make everything in your life easy, you still need to put in effort. This is simply a tool to help you focus. This isn't a tool for motivation. School was still hard for me. For those with severe ADHD, this medication does not make you feel cracked out. If anything, I might be too calm. I haven't noticed anxiety either. This has been a game changer, just don't abuse it and be realistic. This isn't magic.",
    "I finally got diagnosed when I was 40. I was in college and just couldn't focus or comprehend my classes. I thought there was something wrong with my head. I've been abused for a very long time. I went to my counselor and suggested I get tested for ADHD. I was very relieved it wasn't head problems. I was diagnosed with ADHD. I suffered for 40 years with all the symptoms but never thought about ADHD. When I was put on Adderall, I couldn't believe the difference. My grade point was 3.67. I was very proud of myself. I've been taking it ever since, 30mg twice a day. People can tell when I'm not on it, big difference. My insurance didn't cover it, so I was paying over $200. My insurance started paying last year. THANK YOU FOR READING MY STORY.",
    "Judging from the reviews, I’m clearly not the only one who has had a HORRIBLE experience with the manufacturer “Lannett.” Please, anyone having issues with them, fill out a complaint form to the FDA MedWatch! They need to know how badly it is affecting people! Unbelievable!!!",
    "The Teva that I normally take is on back order. Tried Epic brand. Immediately started feeling dizzy and a headache started. Pulse is racing, resting pulse is 67, and my current resting is 94. Feel like I am having an out-of-body experience, also paranoid. When talking, I felt like I was talking really fast, but my daughter said I was actually talking slowly. Everyone keeps looking at me really weird. My eyes are blinking uncontrollably. I keep crying for no reason. I hope this medication wears off very, very soon. Dry mouth, which is normal, but this was almost immediate and severe. My arm occasionally twitches, and I seem to now be shivering. If I took this brand normally, I would never want to take amphetamine/dextroamphetamine again.",
    "This Alvogen brand is terrible. I personally have had an allergic reaction to this medication and am very upset my pharmacy has switched my normal brand to this brand. I have made complaints and am looking into further action.",
    "I've been on Adderall for 5 years now, 15 mg twice daily. I started on 10 mg 2x daily, but the lower doses are associated with aggressive behaviors. Is it a flawless savior? Do I still struggle at times with ADHD? Absolutely! Medications, i.e., insulin, all have side effects. As a patient, you must ask yourself if the side effects outweigh the benefits. I refused treatment until age 32, which has been beneficial to my physical health. If you are at the mercy of ADHD, I strongly advise you to use some of the new apps with or without meds. Daily for the first 3 weeks is simply miraculous. Lastly, the world or your coworkers don't need to know about your diagnosis. ADHD is still stigmatized as a disorder that only stupid people have. My first RN job, I was viciously bullied once word got out about my ADHD by my fellow RNs! Now I make more than a Nurse Practitioner! #Strength",
    "I had a great experience with the blue Teva manufactured Adderall generic, but Walgreens switched to Mallinckrodt, and it is much less effective and caused headaches. My psychiatrist confirmed that he had several complaints from patients, so please be aware and report to the FDA if you are having the same issues.",
    "This month I received an RX that was half Lannett half Teva due to the shortage. I tried to not mix the brands when dosing. Let me say the difference between these two manufacturers is shocking. Lannett, not only entirely ineffective, is actually just down right harmful. My chest hurts on it, crazy headaches, pounding heart, nausea, I am tired, and VERY little focus which is only in the immediate beginning. Teva however, works like it’s supposed to, and I don’t feel like I’m literally dying.",
    "It makes you feel very energetic and makes you want to accomplish everything. It makes you very interested in stuff going on with yourself. It keeps you awake and very alert, and you feel like you are on top of the world.",
    "I floated through high school, got honors and graduated a year early. Did the same through a state college, even though I was accepted to Ivy Leagues with scholarships. I chose the easy route as I hated books and never read anything, despite being able to pass with a bachelor's in college and honors in high school just on auditory lecture learning. I was scared to challenge myself. Went to nursing school 10 years ago and failed out. Then I tried again on Adderall - Out of a class of 140, I'm #1. Everything I read I absorb. I can NOW focus. Everything's wired tight, and each day I am limitless on what I can learn. I feel music. I'm in touch with everything. I thank every day I'm on it.",
    "I was first diagnosed with ADHD at the age of 6. My parents, at the time, decided against treating my illness with any form of medication. This was in the mid-90s during a time where ADHD and ADHD medications were very controversial. This led to self-medicating with prescription opioids throughout my teens and early twenties. It wasn't until several psychiatrists continued to stress the importance of treating my ADHD that I finally decided to try Adderall. And I can proudly say that it changed my life and saved me from a serious drug addiction. I'm now in my third year of school studying psychopharmacology. Thank you, Adderall.",
    "I've taken Adderall for 2 years. The first 6 months worked very well. Balanced me out, kept me focused & side effects were minimal. But, the efficiency of Adderall has really gone down in my experience. I often find myself hyper focusing on things I don't need to & the side effects have gotten much worse. Insomnia, horrible dry mouth (= more cavities), I get antsy & shaky at times & I also feel I've become dependent on it. Next doctor's appointment, I will be asking to switch out to something else. It's a good medicine at first, but understand that many of the great reviews are likely written by newer Adderall users.",
    "I stopped taking this medication 6 years ago because I built up a tolerance to it. But, it seriously was the best thing to ever happen to me. I've always had untreated ADHD, and when I finally received treatment, I flourished. Now, after 6 years, I am giving it a try again. So far, it's working great. The two things I don't like about Adderall are that I talk WAY too much, and share WAY too much information. In fact, I call up family members and talk to them to death. I had to write myself a note and tape it to the phone to not call or text anyone! And the second thing is the comedown, by the time the medication wears off, I am drained!",
    "Once getting on Adderall, I found it gave me just enough euphoria to put down everything from alcohol to opiates, while giving me the drive and ambition to seek an engineering degree. I must warn people Adderall is a stimulant. It's out of your body rather quickly (1-2 days), so addiction in the 'physical withdrawal' sense is not much, although years of taking it will keep you relying on it - that's a PROMISE. Depending on the dosage, you'll be severely lethargic and wind up sleeping for a few days. Beware of the day's end - you'll likely need something to sleep or relax, which can cause problems. Despite the caution, you'll be a morning person and love it. Just remember the word 'moderation,' and you'll be a new you!",
    "I have run the gauntlet of ADD meds, starting with Concerta then tried Vyvanse which worked well in the beginning, then my doctor switched to Adderall XR, then to IR, which works best for me. I take 20mg twice a day, it definitely helps with non-stop thinking, racing thoughts, and just simply getting motivated. I have been on the IR for about a year and the highs are finally outweighing the lows. 39 years old and can see light at the end of the tunnel.",
    "Adderall saved me. I went back to college and was finally able to start passing school, my depression started getting better, my mood has become more stabilized, and I can enjoy things without getting ",
    "I knew I struggled with ADD in college but refused to go on medication because of the stigma associated with Adderall. My father has ADD as well and refused medications. Now at 56, he is homeless, can't hold down a job, can't control his finances, health, or any responsibilities. When I graduated college and started my full-time job, I realized that I was heading towards the same path as my pops. I love my job and am very passionate about it, but following instructions or staying on task during an 8-hour workday was IMPOSSIBLE. 5mg of XR/day (2x on my v. busy days) saved my job and life! I feel like I finally have a clutch to support me with my disability now. It has improved every aspect of my life: social, financial, academic, etc.",
    "I've been taking 60mg of Adderall a day for 14 years now. It's a miracle! I don't think I would have made it through high school or college without it. I started when I was 14 and starting high school. I loathed getting up early, but shortly after taking my pills, I was awake and motivated to get ready and go about my day. It made boring classes seem more interesting. It gives you this focus and drive to be productive. I don't feel like myself without them. I'm cranky, unmotivated, eat and sleep a lot if I don't take it. Just be cautious with dosage. You do develop a tolerance to it over time. If your blood pressure goes way up and you feel jittery or shaky, you're taking too high of a mg. People should start with 10 or 20mg at first.",
    "So, I have had ADHD since I was young. I never liked the pills they gave me when I was younger because I was already a thin kid and then taking Adderall I would eat even less. So I stopped taking the medication. When I was taking this medication, I got Most Improved Student! I went without the drug for years, until just about 2 years ago I started taking it again, and it has helped me so much! I am very thankful for this drug. I suffer from fatigue and many, many other problems. This drug is one of many I need to think straight and to not get out of control. It also helps me big time with my anger issues. Hope this helps someone! Star Kid is out!",
    "Adderall (amphetamine and dextroamphetamine) immediate release has greatly (95%) improved my symptoms of ADHD including concentration, focus, memory, attention span, retention of information, and to some extent my energy and grades. It's a very strong stimulant, so it does have temporary side effects. Most will go away in two to four weeks, like euphoria, anxiety, and teeth grinding, but the dry mouth and insomnia if taken late will not subside for months. However, it has helped me A LOT.",
    "AHDH medications sucks.They don't treat ADHD believe me. They just delay it till the crash comes and you feel 40 times more worse.They have  destroyed the lives of hundreds of people due to prolonged use. They are just street meth.Believe me I have ADHD and the best medicine I would suggest are a non-stimulants like welbutrin and strattera.If they didn't work for you then never ever use stimulants they will ruin your life. Just rely on adaptogens eg rhodiola, ginseng, good diet, exercise and meditation. If study is a problem for you then use you hyperfocus and study something that you are interested in.You may have found some good reviews about these  stimulants however these people are new and they are unaware of there consequences. I have tried stimulants for 15 years so I am confident and sure about what I say.",
    "I was diagnosed with ADHD unexpectedly when I started going to a counseling center a couple months ago, after I got in trouble for bringing marijuana to school. I was also diagnosed with severe depression and anxiety. I am 15 and this all came as one big unexpected shock to me. I felt useless and pathetic knowing this. I was put on medication for all of the mental disorders, including Adderall. I have always been a good student, but now I am actually able to focus in school and now, I'm excited about going to classes and doing homework. I actually feel like I'm worth something for once.",
    "I am 51 and have been on Adderall for 15 years. I take 20 mg twice a day. It helps me concentrate and stay focused. I skip taking it for one day every week, this helps me see where the Adderall helps in my life and was suggested by my doctor to help my body not build a tolerance to Adderall. At this time, I personally don't believe Adderall is 'addicting' when taken properly. While on vacation, I went a week without it and never felt any withdrawal from the Adderall. I keep my Adderall and other meds in a metal lockbox that locks onto a shelf in my fridge because people do abuse Adderall.",
    "I am 25 years old, married with a 6-month-old son. I was diagnosed with severe ADHD at the age of about 10. I'm talking horrible behavior, bad grades, constant moving, etc. My mother told the doctors no medicine at that age. Then around 12, my mother caved in and gave me the Adderall. I hated it because of the instant side effects for me. I continued to take it until about 14, and I made a 100% improvement. At 14, I learned to cope with the ADHD on my own. But now, 11 years later, in the real world with many stresses, my ADHD had gotten worse than ever, to the point that my wife wanted to leave me because she couldn't handle it. I got my prescription back, and my life is amazing. 30mg IR 3x a day, 1 in the morning, 1 after lunch, 1 on the way home from work.",
    "I've taken Vyvanse extended-release and Adderall extended-release. I didn't like the mood swings and irritability I suffered when they would wear off. My doctor has since put me on Adderall immediate release 30-milligram tablets twice a day. I've taken these tablets for 2 years now and love that I can focus and I am not having mood swings or irritability at all. I have experienced dry mouth and some jitters as well as trouble sleeping. I take Ambien to sleep, and it is no longer an issue. I have to take a vitamin supplement due to a huge weight loss, though. I was overweight when I started Adderall and now am at a healthy weight and maintaining that weight without issue.",
    "Good with increased mental focus and fewer distractions by activities that were going on around me. I have nothing negative to say about the Adderall. It has improved my ability to control my attention and give me greater intensity in thinking and reasoning.",
    "I have no problem with generic Adderall. I get 60 30mg tablets by Alvogen and it works fine for me. I used to get the Teva brand but times are rough, as we all know. I'm very grateful for this medication because of my Tourette Syndrome and ADHD. It makes life hard to function, so I praise this medication for helping my tics and verbal stutters. It's incredible what Adderall can do when taken properly.",
    "ADD is NOT a made-up condition. I'm 26. Without Adderall/Vyvanse, I have no mental energy or focus to do anything. And it has been this way my entire life. School has gone from being an F and D student to being an A and B student. It has nothing to do with 'being lazy' and everything to do with having a real chemical imbalance in the brain. Anyways, I have been full-time for 2 years until 7 weeks ago. I convinced myself it wasn't working anymore and I didn't need it. Big mistake! I am ready to start up again next week. I can feel the old me coming back, the me I hated. If you truly have ADD/ADHD, this will change your life for the better. Some negatives are sleeping less, decreased appetite, and often weak erections on it (despite high libido).",
    "I have been taking Adderall for 2 years now (3 of the 30mg tablets a day). It's a great way to get your work done in school and anything else you may need motivation to do. It also makes me more social and interested in things I wouldn't normally be interested in. The bad thing about it is that if you go even one day without it you eat 3 times more than you usually would and you feel irritable and agitated. Overall, couldn't live without it.",
    "I'm a 57-year-old male that has been clean and in recovery for ten years now. I have abstained from anything stronger than aspirin the whole time. Chronic pain had made it necessary to begin a closely monitored treatment schedule, but I was still losing a lot of focus on tasks at work and any motivation for anything but sleeping at home. After talking to the doctor, we added 20mg Adderall 3 times a day. The difference has been amazing. I normally work pretty long hours and had been having trouble staying awake in the morning going to work and evenings going home. No more. Properly scheduling the doses keeps me active and focused my entire day. Didn't take long to find out that it increased energy and desire in other areas also. All others.",
    "Finally, I was diagnosed with ADD as an adult after struggling my whole life with ADD. I was put on Adderall, and my life changed 100% for the better. I think this is a wonderful medication for those with ADD!",
    "I take Adderall XR 30 mg and it has always worked for me until this last batch. It's a Teva batch and it makes me feel horrible. Out of nowhere, I get high blood pressure and I can't focus. I get fatigued and it feels like I'm gonna pass out sometimes. Something is truly wrong here. It's scary because I need this medication to hold down a job because without it, I'm a hot mess. I pray this gets resolved soon. Thinking about switching to Desoxyn. Really good reviews and no shortage.",
    "Yes, this medication does work wonders, at first. Diagnosed ADHD (by a Psychiatrist) at the age of 26. The first 3 years it worked quite well and felt like a godsend. I took 5-6 days a week and my life demonstratively improved. Focus, completing tasks, mental clarity, improved self-esteem...life was good. Adderall, like other CNS stimulants, tends to become less effective after time and I noticed this more pronouncedly by my 5th year. At that point, I felt trapped by the drug and tried to stop. The problem was that even after a month or more without Adderall, none of the discontinuation symptoms were improving. While I continue to use Adderall for maintenance, I derive little benefit. Be aware, the effects won't last indefinitely!",
    "I was recently diagnosed with ADHD and got my first prescription for Adderall, hoping it would help, but I felt nothing. Started at 20 mg, then tried 40 mg, and finally 60 mg today and only noticed a slight quieting for my racing thoughts (but it could've been some brain fog since they still were pretty bad), still felt restless, etc. Came on here to see others' experiences and saw that Lannett was a really bad generic manufacturer, and so I went to check my prescription and BOOM, Lannett. Knowing that this mfr has been garbage across the board with people has at least been comforting and gives me hope for the next medication attempt (which I will be making sure my psychiatrist puts the name of an authorized generic and that it must be from that mfr).",
    "Adderall has been a blessing to me. I take 30mg twice a day, and my thinking has become so much more clear. I am now able to pay attention and absorb what is going on around me. I have had no negative side effects except for an occasional night where it might take me an extra 30 minutes to fall asleep. I still have a healthy appetite since taking Adderall. This medicine has made my life so much better.",
    "I was diagnosed with A.D.D, and I've been using Adderall for just over 2 years now. My 9th year of school, I finished with a very low GPA, just over a 1.0, and finished most of my classes with either Fs or Ds. But this past year that I was able to get my medicine, I was awarded AB Honor Roll and passing every class with an A except 2 Bs. The massive improvement of my ability to focus and actually want to work actually made the principal think I was cheating since I've had such a bad school record (for grades).",
    "Adderall (amphetamine) will seem fantastic the first time it is prescribed. But as the years go by and tolerance increases, you will need more. It also down-regulates dopamine in the brain (which eventually means that it has been associated with dopamine depletion in the striatal area of the brain and frontal cortex). Dopamine effects pleasure. When it becomes low (the brain will compensate by lowering dopamine when taking amphetamine, because Adderall increases it). When this happens, you will need to continue taking it or you may experience what is called anhedonia (look that up). This is a very dangerous drug that can permanently change brain chemistry.",
    "I started taking Adderall when I was 26 y/o, and it was AMAZING for about 2 years. My dose started out at 30 mg/day in the beginning, and after 2 years was up to 60 mg/day (30 mg IR twice daily). I started getting increasingly paranoid, losing what seemed like more and more sleep with each passing month. I kept thinking that I was seeing red and blue lights on my walls at night, which made me think the cops were after me outside, even though I didn't do anything that would require police assistance. Until one day when I lost my mind, literally. I was taken by ambulance to the hospital and put on a 72-hour psychiatric hold, for which I ended up staying at the hospital almost 2 weeks. Diagnosed with amphetamine-induced schizoaffective disorder!!!",
    "I was once a procrastinating, underemployed, muscular 18-year-old who was unsure of his future. My ADHD made it impossible to focus, my motivation was terrible, and I snapped on anyone over the smallest thing. I knew about Ritalin... also knew its excess side effects. I heard about Adderall and decided maybe I should speak with my PCP. He prescribed me Adderall, a pill that can either make or break you. If you have had ANY history of drug abuse, AVOID IT. It took me a month to realize I was abusing it. I lost sleep, weight, and gained a tolerance. When I decided I'd better let my wife handle my medication, she gave me my two IRs per day and still does. It helped a lot. The medication is wonderful for ADHD but can very easily kill you if you abuse it.",
    "While not perfect, this drug helped me achieve around an 80% improvement in my focus, attention, and ability to see tasks through to the end. I take 20 mg IR in the morning and 20 mg early in the afternoon. I was never diagnosed with A.D.D when I was a kid, likely because I barely went to see doctors as a child. I used illicit drugs my whole life until it caused me to almost kill myself. After being clean for a year, I noticed my problems persisted with attention, focus, and finishing tasks. After seeing a psychiatrist and getting a proper test/diagnosis, I'm grateful. It's helped a lot.",
    "What a genius medication! It changed my life completely. I strongly believe, based on my experiences using it for over a year, that Adderall is extremely helpful for those who really suffer from ADHD. I'm much more focused, happy, and I get a lot accomplished each day, my emotions are in place. It helps me keep my weight down. There are some side effects, my main concern is trouble sleeping, but that can be controlled with meditation and other methods. I wish I had gotten diagnosed earlier, my life would have been much different. But it's never too late. Grateful for this medicine."
  ]
}
